#include <iostream>
using namespace std;


/*
ทหารหนึ่งตัวสามารถใหก้ าเนดิ ลูกเป็นผงึ้ งานไดเ้พยี งหนงึ่ ตัว
สว่ นผงึ้ งานหนึ่งตัวสามารถให้ก าเนิดลูกได ้สองตัวเป็นผึ้งงานและผึ้งทหารอย่างละหนึ่งตัว
เมื่อให้ก าเนิดลูกผึ้งแล ้ว ผึ้งงานและผึ้งทหารทเี่ ป็นผูใ้หก้ าเนดิจะตายไป
ส าหรับนางพญาสามารถใหก้ าเนดิ ลูกเป็นผงึ้ งานไดเ้พยี งหนงึ่ ตัว และมชี วีติ อยู่ตลอดไปไม่มีวันตาย
*/


int main()
{
    int n;
    cin>>n;
    while(n!=-1)
    {
        int q=0,worker_bee=1;
        while(n--)
        {
            int temp=worker_bee;
            worker_bee+=q+1;
            q=temp;
        }
        cout<<worker_bee<<" "<<q+worker_bee+1<<endl;
        cin>>n;
    }
    return 0;
}